### Trabajaremos con la librer√≠a Pandas

In [77]:
import numpy as np
import pandas as pd

In [78]:
# Creating a Series

a = pd.Series(np.random.randint(0,100,10))
a

0    72
1    27
2     9
3    62
4    26
5    31
6    72
7    72
8    12
9    93
dtype: int32

In [79]:
b = pd.Series(["Argentina", "Uruguay", "Paraguay", "Chile"], name="Chupar2030")
b

0    Argentina
1      Uruguay
2     Paraguay
3        Chile
Name: Chupar2030, dtype: object

In [80]:
# Creating Dataframes

A = pd.DataFrame({"country" : ["Argentina", "Uruguay", "Paraguay", "Chile"],
                  "population": [47_327_407, 3_530_912, 7_532_138, 19_116_201]})
A

     country  population
0  Argentina    47327407
1    Uruguay     3530912
2   Paraguay     7532138
3      Chile    19116201

In [81]:
# Extracting a serie

c = A.country
c

0    Argentina
1      Uruguay
2     Paraguay
3        Chile
Name: country, dtype: object

In [82]:
d = A['population']
d

0    47327407
1     3530912
2     7532138
3    19116201
Name: population, dtype: int64

In [83]:
# Importing Dataframe from file

B = pd.read_csv('./Input/world_population_1960_2015.csv', encoding='latin-1', delimiter=',')
B.head()

,Country Name,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
0,Aruba,54208.0,55435.0,56226.0,56697.0,57029.0,57360.0,57712.0,58049.0,58385.0,...,100830.0,101218.0,101342.0,101416.0,101597.0,101936.0,102393.0,102921.0,103441.0,103889.0
1,Andorra,13414.0,14376.0,15376.0,16410.0,17470.0,18551.0,19646.0,20755.0,21888.0,...,83373.0,84878.0,85616.0,85474.0,84419.0,82326.0,79316.0,75902.0,72786.0,70473.0
2,Afghanistan,8994793.0,9164945.0,9343772.0,9531555.0,9728645.0,9935358.0,10148841.0,10368600.0,10599790.0,...,25183615.0,25877544.0,26528741.0,27207291.0,27962207.0,28809167.0,29726803.0,30682500.0,31627506.0,32526562.0
3,Angola,5270844.0,5367287.0,5465905.0,5565808.0,5665701.0,5765025.0,5863568.0,5962831.0,6066094.0,...,18541467.0,19183907.0,19842251.0,20520103.0,21219954.0,21942296.0,22685632.0,23448202.0,24227524.0,25021974.0
4,Albania,1608800.0,1659800.0,1711319.0,1762621.0,1814135.0,1864791.0,1914573.0,1965598.0,2022272.0,...,2992547.0,2970017.0,2947314.0,2927519.0,2913021.0,2904780.0,2900247.0,2896652.0,2893654.0,2889167.0

In [84]:
# Viewing selected columns

C = B[['Country Name', '2015']]
C.head(2)

  Country Name      2015
0        Aruba  103889.0
1      Andorra   70473.0

In [85]:
# Selecting Series from rows

C.loc[12]

Country Name      Austria
2015            8611088.0
Name: 12, dtype: object

In [86]:
# Selecting simple values

B.loc[15]['2014']

11231213.0

In [87]:
B.at[15, '2014']

11231213.0

In [88]:
# Managing nulls values

C.iat[1, 1] = np.nan
C.iat[3,0] = np.nan
C.head()

  Country Name        2015
0        Aruba    103889.0
1      Andorra         NaN
2  Afghanistan  32526562.0
3          NaN  25021974.0
4      Albania   2889167.0

In [89]:
D = C.dropna()
D.head()

           Country Name         2015
0                 Aruba     103889.0
2           Afghanistan   32526562.0
4               Albania    2889167.0
5            Arab World  392022276.0
6  United Arab Emirates    9156963.0

In [90]:
D = C.fillna({'Country Name': 'AA', '2015': 0})
D.head()

  Country Name        2015
0        Aruba    103889.0
1      Andorra         0.0
2  Afghanistan  32526562.0
3           AA  25021974.0
4      Albania   2889167.0

In [91]:
# Filtering data

E = C.dropna()
E = E[ E['Country Name'].str.startswith('B') ]
E.tail()

               Country Name       2015
28                 Barbados   284215.0
29        Brunei Darussalam   423188.0
30                   Bhutan   774830.0
31                 Botswana  2262485.0
252  British Virgin Islands    30117.0

In [92]:
E = E[ E['2015'] > 10_000_000]
E

    Country Name         2015
14       Burundi   11178921.0
15       Belgium   11285721.0
16         Benin   10879829.0
17  Burkina Faso   18105570.0
18    Bangladesh  160995642.0
26       Bolivia   10724705.0
27        Brazil  207847528.0

In [93]:
countries = ['Argentina', 'Paraguay', 'Uruguay', 'Chile']
F = C[ C['Country Name'].isin(countries) ]
F

    Country Name        2015
7      Argentina  43416755.0
37         Chile  17948141.0
193     Paraguay   6639123.0
247      Uruguay   3431555.0

In [94]:
# Ordering data

E.sort_values(by= '2015', ascending= False)

    Country Name         2015
27        Brazil  207847528.0
18    Bangladesh  160995642.0
17  Burkina Faso   18105570.0
15       Belgium   11285721.0
14       Burundi   11178921.0
16         Benin   10879829.0
26       Bolivia   10724705.0

In [95]:
# Regrouping data

G = pd.read_csv('./Input/metal_bands_2017.csv', encoding='latin-1', index_col=0)
G.tail(4)

            band_name  fans formed          origin split              style
4996       Avicularia     0   2003         Croatia     -   Avantgarde death
4997            Awake     0   2006  United Kingdom  2006  Heavy,Progressive
4998           Axatak     0   1983       Australia  1988    Hard rock,Heavy
4999  Axis Of Despair     0   2014          Sweden  2014          Grindcore

In [96]:
G = G.drop_duplicates()
G.head()

,band_name,fans,formed,origin,split,style
0,Iron Maiden,4195,1975,United Kingdom,-,"New wave of british heavy,Heavy"
1,Opeth,4147,1990,Sweden,1990,"Extreme progressive,Progressive rock,Progressive"
2,Metallica,3712,1981,USA,-,"Heavy,Bay area thrash"
3,Megadeth,3105,1983,USA,1983,"Thrash,Heavy,Hard rock"
4,Amon Amarth,3054,1988,Sweden,-,Melodic death

In [97]:
H = G.groupby(by= 'origin',dropna= True)['origin']

In [98]:
H.count().sort_values(ascending= False).head() # top 5 country's bands

origin
USA               1123
Sweden             469
Germany            393
United Kingdom     339
Finland            300
Name: origin, dtype: int64